# GetCommonCoverType Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarHostData..::..GetCommonCoverType Method
RebarHostData Class See Also
---
If all exposed faces of the host have the same associated CoverType, return that CoverType; otherwise, return nullNothingnullptra null reference (Nothing in Visual Basic).
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public RebarCoverType GetCommonCoverType()
```

Visual Basic
---
```text
Public Function GetCommonCoverType As RebarCoverType
```

Visual C++
---
```text
public:
RebarCoverType^ GetCommonCoverType()
```

# ### Return Value
The common CoverType for all exposed faces, or nullNothingnullptra null reference (Nothing in Visual Basic) if there are multiple CoverTypes.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace